# FilterElement Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterElement Class
Members See Also
---
The base class for filter elements in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterElement : Element
```

Visual Basic
---
```text
Public Class FilterElement _
	Inherits Element
```

Visual C++
---
```text
public ref class FilterElement : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FilterElement Autodesk.Revit.DB..::..ParameterFilterElement Autodesk.Revit.DB..::..SelectionFilterElement
# See Also
FilterElement Members
Autodesk.Revit.DB Namespace